BalaviDeshna/LPC55S69-Trustzone-PinVault/lpcxpresso55s69_hello_world_s_cm33_core0/source/veneer_table.c
/*
 * Copyright 2018 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#if (__ARM_FEATURE_CMSE & 1) == 0
#error "Need ARMv8-M security extensions"
#elif (__ARM_FEATURE_CMSE & 2) == 0
#error "Compile with --cmse"
#endif

#include "stdint.h"
#include "arm_cmse.h"
#include "tzm_api.h"
#include "veneer_table.h"
#include "fsl_debug_console.h"
#include "fsl_gpio.h"
#include <string.h>
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define MAX_STRING_LENGTH 0x400
#define MAX_LOG_ENTRIES 20

// . hard-coded key for verification
static const uint8_t firmware_key[] = {
    0x2B, 0x7E, 0x15, 0x16, 0x28, 0xAE, 0xD2, 0xA6,
    0xAB, 0xF7, 0x15, 0x88, 0x09, 0xCF, 0x4F, 0x3C
};
#define FIRMWARE_KEY_LENGTH 16
static uint32_t current_firmware_version = 1;

typedef struct {
	int event; // 1, 0, -1
	int attempt_number;
}Audit_Entry;

static Audit_Entry audit_log[MAX_LOG_ENTRIES];
static int log_count = 0;
/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
/* strnlen function implementation for arm compiler */
#if defined(__arm__)
size_t strnlen(const char *s, size_t maxLength)
{
    size_t length = 0;
    while ((length <= maxLength) && (*s))
    {
        s++;
        length++;
    }
    return length;
}
#endif

TZM_IS_NOSECURE_ENTRY void DbgConsole_Printf_NSE(char const *s)
{
    size_t string_length;
    /* Access to non-secure memory from secure world has to be properly validated */
    /* Check whether string is properly terminated */
    string_length = strnlen(s, MAX_STRING_LENGTH);
    if ((string_length == MAX_STRING_LENGTH) && (s[string_length] != '\0'))
    {
        PRINTF("String too long or invalid string termination!\r\n");
        while (1)
            ;
    }

    /* Check whether string is located in non-secure memory */
    /* Due to the bug in GCC 10 cmse_check_pointed_object() always fail, do not call it, see GCC Bugzilla - Bug 99157.
       Solved in GCC 10.3 version */
#if !((__GNUC__ == 10) && (__GNUC_MINOR__ < 3))
    if (cmse_check_address_range((void *)s, string_length, CMSE_NONSECURE | CMSE_MPU_READ) == NULL)
    {
        PRINTF("String is not located in normal world!\r\n");
        while (1)
            ;
    }
#endif
    PRINTF(s);
}

TZM_IS_NOSECURE_ENTRY char DbgConsole_Getchar_NSE(void){
    return DbgConsole_Getchar();
}


TZM_IS_NOSECURE_ENTRY void DbgConsole_Putchar_NSE(char ch){
    DbgConsole_Putchar(ch);
}

TZM_IS_NOSECURE_ENTRY int verify_pin(const char* entered_pin){
	static const char secure_pin[] = "0987";
	static int attempt_counter = 0;
	int result;

	// locks out on 3 failures
	if (attempt_counter >= 3){
		result = -1;
	}

	// success on pin match
	else if (strcmp(entered_pin, secure_pin) == 0){
		attempt_counter = 0;
		result = 1;
	}

	// failure on all other cases
	else{
		attempt_counter++;
		result = 0;
	}

	// logging the attempt
	audit_log[log_count % MAX_LOG_ENTRIES].event = result;
	audit_log[log_count % MAX_LOG_ENTRIES].attempt_number = attempt_counter;
	log_count++;
	return result;
}

TZM_IS_NOSECURE_ENTRY void GPIO_PortClear_NSE(uint8_t pin_number){
	GPIO_PortClear(GPIO, 1u, 1u << pin_number);
}

TZM_IS_NOSECURE_ENTRY void GPIO_PortSet_NSE(uint8_t pin_number){
	GPIO_PortSet(GPIO, 1u, 1u << pin_number);
}

TZM_IS_NOSECURE_ENTRY int get_log_count_NSE(void){
	return log_count;
}

TZM_IS_NOSECURE_ENTRY int get_log_event_NSE(int index){
	if(index < 0 || index >= MAX_LOG_ENTRIES) return -999;
	return audit_log[index % MAX_LOG_ENTRIES].event;
}

TZM_IS_NOSECURE_ENTRY int get_log_attempt_NSE(int index){
	if(index < 0 || index >= MAX_LOG_ENTRIES) return -999;
	return audit_log[index % MAX_LOG_ENTRIES].attempt_number;
}

TZM_IS_NOSECURE_ENTRY void print_int_NSE(int value){
	PRINTF("%d", value);
}

TZM_IS_NOSECURE_ENTRY int verify_firmware_NSE(const firmware_buffer *image_info, const firmware_buffer *signature_info, uint32_t version){
	uint32_t i;

	if(cmse_check_address_range((void*)image_info, sizeof(firmware_buffer), CMSE_NONSECURE | CMSE_MPU_READ) == NULL){
		PRINTF("INVALID IMAGE STRUCTURE POINTER");
		return -1;
	}
	if(cmse_check_address_range((void*)signature_info, sizeof(firmware_buffer), CMSE_NONSECURE | CMSE_MPU_READ) == NULL){
		PRINTF("INVALID SIGNATURE STRUCTURE POINTER");
		return -1;
	}
	if(cmse_check_address_range((void*)image_info->array, image_info->array_length, CMSE_NONSECURE | CMSE_MPU_READ) == NULL){
		PRINTF("INVALID IMAGE POINTER.\r\n");
		return -1;
	}
	if(cmse_check_address_range((void*)signature_info->array, signature_info->array_length, CMSE_NONSECURE | CMSE_MPU_READ) == NULL){
		PRINTF("INVALID SIGNATURE POINTER.\r\n");
		return -1;
	}
	if (version < current_firmware_version){
		PRINTF("FIRMWARE VERSION TOO OLD.\r\n");
		return -2;
	}

	/*
	 * . security flaws so far, to be improved:
	 * 1. if the nth bit and the (image_length+n)th bit are swapped, it will still result in the same value
	 * 2. if image_length < FIRMWARE_KEY_LENGTH, then the rest of the firmware won't be evaluated, posing risks
	 */
	uint8_t expected_signature[FIRMWARE_KEY_LENGTH] = {0};
	for(i = 0; i < image_info->array_length; i++){
		expected_signature[i % FIRMWARE_KEY_LENGTH] ^= image_info->array[i] ^ firmware_key[i % FIRMWARE_KEY_LENGTH];
	}

	/*
	 * . security flaws so far, to be improved:
	 * 1. if signature_length < FIRMWARE_KEY_LENGTH, match will never become 0
	 * if signature_length > FIRMWARE_KEY_LENGTH, trailing data ignored => issue
	 * 2. due to the break, timing related attacks possible
	 *
	 */
	int match = 1;
	for(i = 0; i < FIRMWARE_KEY_LENGTH; i++){
		if(i < signature_info->array_length && expected_signature[i] != signature_info->array[i]){
			match = 0;
			break;
		}
	}
	if(!match){
		PRINTF("THE SIGNATURE DOESN'T MATCH\r\n");
		return -3;
	}

	/*
	 * . anti-rollback protection resets every time the chip power-cycles or resets,
	 *   since current_firmware_version is just a global variable atp
	 */
	current_firmware_version = version;
	PRINTF("firmware verified, updated to version %d\r\n", version);
	return 1;
}
